Revit 2026 API

# ImagePlacementOptionsPlacementPoint Property

---

Identifies which point of the ImageInstance will be aligned to the Location

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoxPlacement PlacementPoint { get; set; }
```
```vb
Public Property PlacementPoint As BoxPlacement
	Get
	Set
```
```cpp
public:
property BoxPlacement PlacementPoint {
	BoxPlacement get ();
	void set (BoxPlacement value);
}
```
```fsharp
member PlacementPoint : BoxPlacement with get, set
```

#### Property Value

BoxPlacement

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The location of the corners of the image in the model depends on the size and orientation of the ImageInstance and the orientation of the view it is placed in.

#### Reference

ImagePlacementOptions Class

Autodesk.Revit.DB Namespace